from ultralytics import YOLO


model = YOLO('best.pt')  

# -----------------------------------------------------------
# 2. 訓練參數設定
# -----------------------------------------------------------
results = model.train(
    data="./data.yaml",
    epochs=20,       # 建議：如果是從頭訓練(沒有預訓練權重)，60 可能有點少，建議試試 100-150
    batch=16,
    imgsz=640,
    cache='ram',
    device=0,
    # --- 增強模型「看細節」的能力 (針對 512x512) ---
    scale=0.8,       # ✅ 很好：讓圖片隨機放大，模擬高解析度特徵
    conf=0.15,
    # --- 驗證階段的設定 (影響 mAP 計算) ---
    max_det=1,       # ✅ 關鍵：訓練時的驗證階段強制只抓一個，mAP 會變高
    iou=0.0,          # 驗證時的 NMS 門檻
    single_cls=True
)